In [1]:
import numpy as np
import pandas as pd

In [23]:
Millonarios = ['Elon Musk', 'Jeff Bezos', 'Bernard Arnault']
Fortuna = ['219 mil millones dólares ', '171 mil millones de dólares', '158 mil millones de dólares']

In [24]:
dict_Millonarios = {'Millonarios': Millonarios, 'Fortuna': Fortuna}

In [25]:
df = pd.DataFrame(dict_Millonarios)

In [26]:
df

       Millonarios                      Fortuna
0        Elon Musk    219 mil millones dólares
1       Jeff Bezos  171 mil millones de dólares
2  Bernard Arnault  158 mil millones de dólares

In [27]:
# Creamos una cantidad de hijos de manera aleatoria
Hijos = np.random.randint(1, 10, size=3)

In [28]:
# Agregamos una nueva columna al DataFrame
df['Hijos'] = Hijos

In [39]:
df

       Millonarios                      Fortuna  Edad  Hijos
0        Elon Musk    219 mil millones dólares     72      2
1       Jeff Bezos  171 mil millones de dólares    68      9
2  Bernard Arnault  158 mil millones de dólares    54      4

### # Agregar una nueva columna usando insert

In [41]:
edad = np.random.randint(50, 80, size=3)

In [38]:
serie = pd.Series(edad, index=np.arange(0, 3))

In [36]:
df.insert(2, 'Edad', serie)

ValueError: cannot insert Edad, already exists

In [40]:
df

       Millonarios                      Fortuna  Edad  Hijos
0        Elon Musk    219 mil millones dólares     72      2
1       Jeff Bezos  171 mil millones de dólares    68      9
2  Bernard Arnault  158 mil millones de dólares    54      4